# Задание 1
animal_type = input("Введите вид питомца: ")
animal_age = input("Введите возраст питомца: ")
animal_name = input("Введите кличку питомца: ")

print(f"Это {animal_type} по кличке \"{animal_name}\". Возраст: {animal_age} года.")

# Задание 2
a1 = input("Введите первый этап развития человека: ")
a2 = input("Введите второй этап развития человека: ")
a3 = input("Введите третий этап развития человека: ")

print(a1, a2, a3, sep=' => ')